logs/sysbench-diskseq/slurm/001/log008.txt
+ cd /nfs/workloads/slurm
+ mkdir -p tmp
+ cd tmp
+ sysbench fileio --file-total-size=1G --file-num=4 prepare
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

4 files, 262144Kb each, 1024Mb total
Creating files for the test...
Extra file open flags: (none)
Creating file test_file.0
Creating file test_file.1
Creating file test_file.2
Creating file test_file.3
1073741824 bytes written in 6.43 seconds (159.15 MiB/sec).
+ sysbench fileio --file-total-size=1G --file-num=4 --file-test-mode=seqrd --file-extra-flags=direct run
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: directio
4 files, 256MiB each
1GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      20990.48
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  327.98
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0001s
    total number of events:              209948

Latency (ms):
         min:                                    0.05
         avg:                                    0.05
         max:                                    6.63
         95th percentile:                        0.05
         sum:                                 9929.15

Threads fairness:
    events (avg/stddev):           209948.0000/0.00
    execution time (avg/stddev):   9.9291/0.00

+ sysbench fileio --file-total-size=1G --file-num=4 --file-test-mode=seqwr --file-extra-flags=direct run
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: directio
4 files, 256MiB each
1GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential write (creation) test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     199.64
    fsyncs/s:                     8.31

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               3.12

General statistics:
    total time:                          10.1065s
    total number of events:              2098

Latency (ms):
         min:                                    0.09
         avg:                                    4.77
         max:                                   79.90
         95th percentile:                       34.95
         sum:                                10002.36

Threads fairness:
    events (avg/stddev):           2098.0000/0.00
    execution time (avg/stddev):   10.0024/0.00

+ sysbench fileio cleanup
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Removing test files...